//===================================================
//
//授業その7[main.cpp]
//Author:KishimotoEiji
//
//===================================================

//********************************
//インクルード
//********************************
#include "main.h"

#include <stdio.h>
#include <stdlib.h>

//********************************
//プロトタイプ宣言
//********************************
namespace
{

}// namespaceはここまで

//===================================================
//メイン関数
//===================================================
void main(void)
{

	//終了メッセージ & Enter入力待ち
	printf("\n\n プログラムを終了します。お疲れ様でした。");
	PressEnter();
}

//===================================================
//Enter入力待ち
//===================================================
void PressEnter()
{
	//Enter入力待ち
	printf("\n\n Press Enter");
	rewind(stdin);
	getchar();
}